## [test1](https://daniellem97.app.spacelift.io/stack/test1/run/01H2QBF5SMHHRVPZ7C9AXE7VK3) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H2QB6EYKKCAXW0WR6K10E290] Planning changes with 1 custom hook...
aws_key_pair.mtc_auth: Refreshing state... [id=mtckey2]
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0c6f2751d81da0f5d]
data.aws_ami.server_ami: Reading...
data.aws_ami.server_ami: Read complete after 1s [id=ami-0a588942e90cfecc9]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-0759e37da43b8a8dd]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0b135be12b18ba9f8]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-01b742c37c9974390]
aws_security_group.mtc_sg: Refreshing state... [id=sg-07da59c1ebeaafff4]
aws_route.default_route: Refreshing state... [id=r-rtb-0b135be12b18ba9f81080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-0e5f728da562999d1]
aws_instance.dev_node: Refreshing state... [id=i-0a712b064ae10d38d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.mtc_auth1 will be created
  + resource "aws_key_pair" "mtc_auth1" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "mtckey3"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local"
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ls: la: No such file or directory
[01H2QB6EYKKCAXW0WR6K10E290] Unexpected exit code when planning changes: 1
```

</details>